<div style="text-align: center;">

# SQL Murder Mystery

</div>

<div style="text-align: center;">
    <img src="thumbnail.png" alt="Thumbnail" width="50%"/>
</div>

A crime has taken place and the detective needs your help. The detective gave you the crime scene report, but you somehow lost it. You vaguely remember that the crime was a murder that occurred sometime on Jan.15, 2018 and that it took place in SQL City. All the clues to this mystery are buried in a huge database, and you need to use SQL to navigate through this vast network of information. Your first step to solving the mystery is to retrieve the corresponding crime scene report from the police department‚Äôs database. Take a look at the cheatsheet to learn how to do this! From there, you can use your SQL skills to find the murderer.

<div style="background: linear-gradient(to right, #e8e8e8, #c0c0c0); 
            padding: 20px; 
            color: black;">

- Important informations üïµÔ∏è:
    - Crime type: murder 
    - Crime date: Jan.15, 2018 
    - Place: SQL City 
    - 1st step: retrieve the corresponding crime scene report from the police dpt database
</div>

<div style="background: linear-gradient(to right, #e8e8e8, #c0c0c0); 
            padding: 20px; 
            color: black;">

üïµÔ∏è Let‚Äôs Get Started!

To crack this case, we‚Äôll use **Python**, **pandas**, and **sqlite3**. These tools will help us query the database and analyze the evidence.

Make sure you‚Äôve installed the following packages:

- pandas
- sqlite3 (built into Python)
- Jupyter Notebook or your preferred IDE

Once everything is ready, let‚Äôs dive into the database!
</div>

In [1]:
import pandas as pd
import sqlite3 as sql

pd.set_option('display.max_colwidth', None)

In [2]:
# Setting up a connection to the database
con = sql.connect('sql-murder-mystery.db')

<div style="background: linear-gradient(to right, #e8e8e8, #c0c0c0); 
            padding: 20px; 
            color: black;">

üïµÔ∏è Now, let's see our schema!
</div>

![Database schema](schema.png)

<div style="background: linear-gradient(to right, #e8e8e8, #c0c0c0); 
            padding: 20px; 
            color: black;">

üïµÔ∏è So, first thing we are going to do is to look at the Crime Scene Report (crime_scene_report), this way we can understand how the data is stored and how to look for our crime case more efficiently.
</div>

In [3]:
query1 = """
SELECT *
FROM crime_scene_report
LIMIT 10;
"""

pd.read_sql_query(query1, con)

,date,type,description,city
0,20180115,robbery,A Man Dressed as Spider-Man Is on a Robbery Spree,NYC
1,20180115,murder,Life? Dont talk to me about life.,Albany
2,20180115,murder,"Mama, I killed a man, put a gun against his head...",Reno
3,20180215,murder,REDACTED REDACTED REDACTED,SQL City
4,20180215,murder,Someone killed the guard! He took an arrow to the knee!,SQL City
5,20180115,theft,Big Bully stole my lunch money!,Chicago
6,20180115,fraud,"Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do\n eiusmod tempor incididunt ut labore et dolore magna aliqua.",Seattle
7,20170712,theft,"A lone hunter stalks the night, firing arrows into the Darkness.\n There is no hiding, no escape. In the distance, the beast\n falters, tethered to the void. The killing blow comes without\n hesitation, without mercy.",SQL City
8,20170820,arson,"Wield the Hammer of Sol with honor, Titan, it is a thing of\n legend, both past and future.",SQL City
9,20171110,robbery,"The Gjallarhorn shoulder-mounted rocket system was forged from\n the armor of Guardians who fell at the Twilight Gap. Gifted\n to the survivors of that terrible battle, the Gjallarhorn\n is seen as a symbol of honor and survival.",SQL City

<div style="background: linear-gradient(to right, #e8e8e8, #c0c0c0); 
            padding: 20px; 
            color: black;">

üïµÔ∏è Taking our first look at the department crime report, we can see that the date is structured in a specific format: year+month+day. Since we know the crime occurred on Jan.15, 2018, we'll look for the date: **20180115**. <br>

There are different types of crimes, like robbery, murder, theft, fraud and so on. We're looking for a specific crime type: **murder**. <br>

Another important information available in the Crime Scene Report table is that this table has crimes from different cities in the country, no only SQL City, so we will need to filter the cases occurred only in: **SQL City**. <br>

Now, let's see how many cases do we find with these 3 informations.
</div>

In [4]:
query2 = """
SELECT COUNT(date)
FROM crime_scene_report
WHERE date = 20180115
    AND type = 'murder'
    AND city = 'SQL City';
"""

pd.read_sql_query(query2, con)

   COUNT(date)
0            1

<div style="background: linear-gradient(to right, #e8e8e8, #c0c0c0); 
            padding: 20px; 
            color: black;">

üïµÔ∏è Great, only one murder occurred in SQL City on Jan.15, 2018. Let's examine it.
</div>

In [5]:
query3 = """
SELECT *
FROM crime_scene_report
WHERE date = 20180115
    AND type = 'murder'
    AND city = 'SQL City';
"""

pd.read_sql_query(query3, con)

,date,type,description,city
0,20180115,murder,"Security footage shows that there were 2 witnesses. The first witness lives at the last house on ""Northwestern Dr"". The second witness, named Annabel, lives somewhere on ""Franklin Ave"".",SQL City

<div style="background: linear-gradient(to right, #e8e8e8, #c0c0c0); 
            padding: 20px; 
            color: black;">

üïµÔ∏è Great, two witnesses! Let's take their information:

- Witness 1:
    - Name: Unknown
    - Place: Last house on Northwestern Dr

- Witness 2:
    - Name: Annabel
    - Place: Somewhere on Franklin Ave

Looking back at our schema page, with the information from the report, we can look at the person table because there we have the name, address_number and address_street_name.
</div>

In [6]:
query4 = """
SELECT *
FROM person
LIMIT 10;
"""

pd.read_sql_query(query4, con)

,id,name,license_id,address_number,address_street_name,ssn
0,10000,Christoper Peteuil,993845,624,Bankhall Ave,747714076
1,10007,Kourtney Calderwood,861794,2791,Gustavus Blvd,477972044
2,10010,Muoi Cary,385336,741,Northwestern Dr,828638512
3,10016,Era Moselle,431897,1987,Wood Glade St,614621061
4,10025,Trena Hornby,550890,276,Daws Hill Way,223877684
5,10027,Antione Godbolt,439509,2431,Zelham Dr,491650087
6,10034,Kyra Buen,920494,1873,Sleigh Dr,332497972
7,10039,Francesco Agundez,278151,736,Buswell Dr,861079251
8,10095,Leslie Thate,729987,2772,Camellia Park Circle,127944356
9,10122,Alva Conkel,779002,116,Diversey Circle,148521773

<div style="background: linear-gradient(to right, #e8e8e8, #c0c0c0); 
            padding: 20px; 
            color: black;">

üïµÔ∏è OK, let's filter to find the information of our first witness.For this task, we can filter by the address_street_name of 'Northwestern Dr' and get the last house by applying ORDER BY in the descending order.
</div>

In [7]:
query5 = """
SELECT *
FROM person
WHERE address_street_name = 'Northwestern Dr'
ORDER BY address_number DESC
LIMIT 1;
"""

pd.read_sql_query(query5, con)

,id,name,license_id,address_number,address_street_name,ssn
0,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949

<div style="background: linear-gradient(to right, #e8e8e8, #c0c0c0); 
            padding: 20px; 
            color: black;">

üïµÔ∏è Now, let's find the information of our second witness. We can filter by the persons who has the name Annabel and lives on Franklin Ave.
</div>

In [8]:
query6 = """
SELECT *
FROM person
WHERE address_street_name = 'Franklin Ave'
    AND name LIKE 'Annabel%';
"""

pd.read_sql_query(query6, con)

,id,name,license_id,address_number,address_street_name,ssn
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143

<div style="background: linear-gradient(to right, #e8e8e8, #c0c0c0); 
            padding: 20px; 
            color: black;">

üïµÔ∏è Now with their id's we can look at their transcripts on the interview table.
</div>

In [9]:
query7 = """
SELECT *
FROM interview
WHERE person_id = 14887
    OR person_id = 16371;
"""

pd.read_sql_query(query7, con)

,person_id,transcript
0,14887,"I heard a gunshot and then saw a man run out. He had a ""Get Fit Now Gym"" bag. The membership number on the bag started with ""48Z"". Only gold members have those bags. The man got into a car with a plate that included ""H42W""."
1,16371,"I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th."

<div style="background: linear-gradient(to right, #e8e8e8, #c0c0c0); 
            padding: 20px; 
            color: black;">

üïµÔ∏è Important information from the transcripts:

Witness 1:
- Gender: Male
- Had a "Get Fit Now Gym" bag (Only gold members have)
- Membership number started with 48Z
- Plate of the car that he got into: H42W

Witness 2:
- Recognizes the killer from her gym
- Saw him last week on Jan.9th

We have information to look at 3 new tables:
- Membership table from the gym (get_fit_now_member) - Suspect is gold member 
  and membrship starts with 48Z
- Check in table from the gym (get_fit_now_check_in) - Check in Jan. 9th = 20180109
- Drivers license table (drivers_license) - Plate includes H42W

By now, we can narrow our search doing an intersection between those three tables and the pearson table. But first, let's look at each one separately to get an idea of what we are looking at. Let's starts with the membership table (get_fit_now_member) to see what we find.
</div>

In [10]:
query8 = """
SELECT *
FROM get_fit_now_member
WHERE membership_status = 'gold'
    AND id LIKE '48Z%';
"""

pd.read_sql_query(query8, con)

      id  person_id           name  membership_start_date membership_status
0  48Z7A      28819   Joe Germuska               20160305              gold
1  48Z55      67318  Jeremy Bowers               20160101              gold

<div style="background: linear-gradient(to right, #e8e8e8, #c0c0c0); 
            padding: 20px; 
            color: black;">

üïµÔ∏è We found two suspects based on membership status and partial ID information. <br>
**Joe Germuska** or **Jeremy Bowers*8 - ONE OF YOU IS GUILTY OF WHAT HAPPENED ON JANUARY 15! ü§£ü§£ü§£ <br>	
Let's dive into check in table.
</div>

In [11]:
query9 = """
SELECT *
FROM get_fit_now_check_in
WHERE check_in_date = 20180109
    AND membership_id IN ('48Z7A', '48Z55');
"""

pd.read_sql_query(query9, con)

  membership_id  check_in_date  check_in_time  check_out_time
0         48Z7A       20180109           1600            1730
1         48Z55       20180109           1530            1700

<div style="background: linear-gradient(to right, #e8e8e8, #c0c0c0); 
            padding: 20px; 
            color: black;">

üïµÔ∏è Damn, both suspects went to the gym on Jan.9th. Let's take a look at the drivers license table.
</div>

In [12]:
query10 = """
SELECT *
FROM drivers_license
WHERE gender = 'male'
    AND plate_number LIKE '%H42W%';
"""

pd.read_sql_query(query10, con)

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS
1,664760,21,71,black,black,male,4H42WR,Nissan,Altima

<div style="background: linear-gradient(to right, #e8e8e8, #c0c0c0); 
            padding: 20px; 
            color: black;">

üïµÔ∏è OK, now let's use connect all this information to see if we can find our suspect!
</div>

In [13]:
query11 = """
SELECT person.id, person.name
FROM get_fit_now_check_in
JOIN get_fit_now_member
    ON get_fit_now_check_in.membership_id = get_fit_now_member.id
JOIN person
    ON get_fit_now_member.person_id = person.id
JOIN drivers_license
    ON person.license_id = drivers_license.id
WHERE get_fit_now_check_in.check_in_date = 20180109
    AND get_fit_now_member.id LIKE '48Z%'
    AND get_fit_now_member.membership_status = 'gold'
    AND drivers_license.gender = 'male'
    AND drivers_license.plate_number LIKE '%H42W%';
"""

pd.read_sql_query(query11, con)

      id           name
0  67318  Jeremy Bowers

<div style="background: linear-gradient(to right, #e8e8e8, #c0c0c0); 
            padding: 20px; 
            color: black;">

üïµÔ∏è BINGO! I KNEW IT! **Jeremy Bowers** you are under arrest, put your hands where i can see it! üòØ<br>

Let's confirm that we got the right guy.
</div>

In [14]:
query12 = """
INSERT INTO solution VALUES (1, "Jeremy Bowers");
"""
con.execute(query12)

query13 = """
SELECT value FROM solution;
"""
pd.read_sql_query(query13, con)

                                                                                                                                                                                                                                                                                                                                                                                                value
0  Congrats, you found the murderer! But wait, there's more... If you think you're up for a challenge, try querying the interview transcript of the murderer to find the real villain behind this crime. If you feel especially confident in your SQL skills, try to complete this final step with no more than 2 queries. Use this same INSERT statement with your new suspect to check your answer.

<div style="background: linear-gradient(to right, #e8e8e8, #c0c0c0); 
            padding: 20px; 
            color: black;">

üïµÔ∏è OHH DAMN! Let's look at the interview transcript of **Jeremy Bowers**.
</div>

In [15]:
query14 = """
SELECT *
FROM interview
WHERE person_id = 67318;
"""

pd.read_sql_query(query14, con)

,person_id,transcript
0,67318,"I was hired by a woman with a lot of money. I don't know her name but I know she's around 5'5"" (65"") or 5'7"" (67""). She has red hair and she drives a Tesla Model S. I know that she attended the SQL Symphony Concert 3 times in December 2017.\n"

<div style="background: linear-gradient(to right, #e8e8e8, #c0c0c0); 
            padding: 20px; 
            color: black;">

üïµÔ∏è OK, now the story is becoming more interesting. Let's take note of this new information. <br>

- New suspect:
    - Gender: female
    - height: 5'5" (65") or 5'7" (67")
    - Hair color: red
    - Car: Tesla Model S
    - Attended the SQL Symphony Concert 3 times in December 2017.

LET'S QUERY AND SOLVE THE CASE!
</div>

In [16]:
query15 = """
SELECT person.name
FROM drivers_license
JOIN person
    ON drivers_license.id = person.license_id
JOIN facebook_event_checkin
    ON person.id = facebook_event_checkin.person_id
WHERE drivers_license.gender = 'female'
    AND drivers_license.height BETWEEN 65 AND 67
    AND drivers_license.hair_color = 'red'
    AND drivers_license.car_model = 'Model S'
    AND facebook_event_checkin.event_name = 'SQL Symphony Concert'
    AND facebook_event_checkin.date LIKE '201712%'
GROUP BY person.name
HAVING COUNT(*) = 3;
"""

pd.read_sql_query(query15, con)

               name
0  Miranda Priestly

<div style="background: linear-gradient(to right, #e8e8e8, #c0c0c0); 
            padding: 20px; 
            color: black;">

üïµÔ∏è OMG! **Miranda Priestly** is the evil mind behind the murder! üò± 
</div>

In [17]:
query16 = """
INSERT INTO solution VALUES (1, "Miranda Priestly");
"""
con.execute(query16)

query17 = """
SELECT value FROM solution;
"""
pd.read_sql_query(query17, con)

                                                                                                                                                          value
0  Congrats, you found the brains behind the murder! Everyone in SQL City hails you as the greatest SQL detective of all time. Time to break out the champagne!

<div style="background: linear-gradient(to right, #e8e8e8, #c0c0c0); 
            padding: 20px; 
            color: black;">

üïµÔ∏è Thanks to everyone who helped solve this case and make SQL City a safer place to live! üéâüéâüéâ
</div>

<div style="background: linear-gradient(to right, #e8e8e8, #c0c0c0); 
            padding: 20px; 
            color: black;">

üïµÔ∏è What we learned from this investigation:

- Basic SQL commands (SELECT, FROM, WHERE) helped us filter through thousands of records in seconds
- JOIN operations were crucial for connecting evidence across different tables
- GROUP BY and HAVING let us find specific patterns (like concert attendance)
- SQL made our detective work efficient by letting us query exactly what we needed

Case closed! Now you know why databases are a detective's best friend. üîç üéâ

</div>